GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
extern volatile CWG3INPPSbits_t CWG3INPPSbits __at(0x25D);
// bitfield macros
#define _CWG3INPPS_PIN_POSN                                 0x0
#define _CWG3INPPS_PIN_POSITION                             0x0
#define _CWG3INPPS_PIN_SIZE                                 0x3
#define _CWG3INPPS_PIN_LENGTH                               0x3
#define _CWG3INPPS_PIN_MASK                                 0x7
#define _CWG3INPPS_PORT_POSN                                0x3
#define _CWG3INPPS_PORT_POSITION                            0x3
#define _CWG3INPPS_PORT_SIZE                                0x2
#define _CWG3INPPS_PORT_LENGTH                              0x2
#define _CWG3INPPS_PORT_MASK                                0x18
#define _CWG3INPPS_CWGINPPS0_POSN                           0x0
#define _CWG3INPPS_CWGINPPS0_POSITION                       0x0
#define _CWG3INPPS_CWGINPPS0_SIZE                           0x1
#define _CWG3INPPS_CWGINPPS0_LENGTH                         0x1
#define _CWG3INPPS_CWGINPPS0_MASK                           0x1
#define _CWG3INPPS_CWGINPPS1_POSN                           0x1
#define _CWG3INPPS_CWGINPPS1_POSITION                       0x1
#define _CWG3INPPS_CWGINPPS1_SIZE                           0x1
#define _CWG3INPPS_CWGINPPS1_LENGTH                         0x1
#define _CWG3INPPS_CWGINPPS1_MASK                           0x2
#define _CWG3INPPS_CWGINPPS2_POSN                           0x2
#define _CWG3INPPS_CWGINPPS2_POSITION                       0x2
#define _CWG3INPPS_CWGINPPS2_SIZE                           0x1
#define _CWG3INPPS_CWGINPPS2_LENGTH                         0x1
#define _CWG3INPPS_CWGINPPS2_MASK                           0x4
#define _CWG3INPPS_CWGINPPS3_POSN                           0x3
#define _CWG3INPPS_CWGINPPS3_POSITION                       0x3
#define _CWG3INPPS_CWGINPPS3_SIZE                           0x1
#define _CWG3INPPS_CWGINPPS3_LENGTH                         0x1
#define _CWG3INPPS_CWGINPPS3_MASK                           0x8
#define _CWG3INPPS_CWGINPPS4_POSN                           0x4
#define _CWG3INPPS_CWGINPPS4_POSITION                       0x4
#define _CWG3INPPS_CWGINPPS4_SIZE                           0x1
#define _CWG3INPPS_CWGINPPS4_LENGTH                         0x1
#define _CWG3INPPS_CWGINPPS4_MASK                           0x10
#define _CWG3INPPS_CWG3INPPS_POSN                           0x0
#define _CWG3INPPS_CWG3INPPS_POSITION                       0x0
#define _CWG3INPPS_CWG3INPPS_SIZE                           0x5
#define _CWG3INPPS_CWG3INPPS_LENGTH                         0x5
#define _CWG3INPPS_CWG3INPPS_MASK                           0x1F
#define _CWG3INPPS_CWG3INPPS0_POSN                          0x0
#define _CWG3INPPS_CWG3INPPS0_POSITION                      0x0
#define _CWG3INPPS_CWG3INPPS0_SIZE                          0x1
#define _CWG3INPPS_CWG3INPPS0_LENGTH                        0x1
#define _CWG3INPPS_CWG3INPPS0_MASK                          0x1
#define _CWG3INPPS_CWG3INPPS1_POSN                          0x1
#define _CWG3INPPS_CWG3INPPS1_POSITION                      0x1
#define _CWG3INPPS_CWG3INPPS1_SIZE                          0x1
#define _CWG3INPPS_CWG3INPPS1_LENGTH                        0x1
#define _CWG3INPPS_CWG3INPPS1_MASK                          0x2
#define _CWG3INPPS_CWG3INPPS2_POSN                          0x2
#define _CWG3INPPS_CWG3INPPS2_POSITION                      0x2
#define _CWG3INPPS_CWG3INPPS2_SIZE                          0x1
#define _CWG3INPPS_CWG3INPPS2_LENGTH                        0x1
#define _CWG3INPPS_CWG3INPPS2_MASK                          0x4
#define _CWG3INPPS_CWG3INPPS3_POSN                          0x3
#define _CWG3INPPS_CWG3INPPS3_POSITION                      0x3
#define _CWG3INPPS_CWG3INPPS3_SIZE                          0x1
#define _CWG3INPPS_CWG3INPPS3_LENGTH                        0x1
#define _CWG3INPPS_CWG3INPPS3_MASK                          0x8
#define _CWG3INPPS_CWG3INPPS4_POSN                          0x4
#define _CWG3INPPS_CWG3INPPS4_POSITION                      0x4
#define _CWG3INPPS_CWG3INPPS4_SIZE                          0x1
#define _CWG3INPPS_CWG3INPPS4_LENGTH                        0x1
#define _CWG3INPPS_CWG3INPPS4_MASK                          0x10
#define _CWG3INPPS_CWGINPPS_POSN                            0x0
#define _CWG3INPPS_CWGINPPS_POSITION                        0x0
#define _CWG3INPPS_CWGINPPS_SIZE                            0x5
#define _CWG3INPPS_CWGINPPS_LENGTH                          0x5
#define _CWG3INPPS_CWGINPPS_MASK                            0x1F

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
extern volatile unsigned char           MD1CARLPPS          __at(0x25E);
#ifndef _LIB_BUILD
asm("MD1CARLPPS equ 025Eh");
#endif
// aliases
extern volatile unsigned char           MDCARLPPS           __at(0x25E);
#ifndef _LIB_BUILD
asm("MDCARLPPS equ 025Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARLPPS0             :1;
        unsigned MDCARLPPS1             :1;
        unsigned MDCARLPPS2             :1;
        unsigned MDCARLPPS3             :1;
        unsigned MDCARLPPS4             :1;
    };
    struct {
        unsigned MDCARLPPS              :5;
    };
} MD1CARLPPSbits_t;
extern volatile MD1CARLPPSbits_t MD1CARLPPSbits __at(0x25E);
// bitfield macros
#define _MD1CARLPPS_PIN_POSN                                0x0
#define _MD1CARLPPS_PIN_POSITION                            0x0
#define _MD1CARLPPS_PIN_SIZE                                0x3
#define _MD1CARLPPS_PIN_LENGTH                              0x3
#define _MD1CARLPPS_PIN_MASK                                0x7
#define _MD1CARLPPS_PORT_POSN                               0x3
#define _MD1CARLPPS_PORT_POSITION                           0x3
#define _MD1CARLPPS_PORT_SIZE                               0x2
#define _MD1CARLPPS_PORT_LENGTH                             0x2
#define _MD1CARLPPS_PORT_MASK                               0x18
#define _MD1CARLPPS_MDCARLPPS0_POSN                         0x0
#define _MD1CARLPPS_MDCARLPPS0_POSITION                     0x0
#define _MD1CARLPPS_MDCARLPPS0_SIZE                         0x1
#define _MD1CARLPPS_MDCARLPPS0_LENGTH                       0x1
#define _MD1CARLPPS_MDCARLPPS0_MASK                         0x1
#define _MD1CARLPPS_MDCARLPPS1_POSN                         0x1
#define _MD1CARLPPS_MDCARLPPS1_POSITION                     0x1
#define _MD1CARLPPS_MDCARLPPS1_SIZE                         0x1
#define _MD1CARLPPS_MDCARLPPS1_LENGTH                       0x1
#define _MD1CARLPPS_MDCARLPPS1_MASK                         0x2
#define _MD1CARLPPS_MDCARLPPS2_POSN                         0x2
#define _MD1CARLPPS_MDCARLPPS2_POSITION                     0x2
#define _MD1CARLPPS_MDCARLPPS2_SIZE                         0x1
#define _MD1CARLPPS_MDCARLPPS2_LENGTH                       0x1
#define _MD1CARLPPS_MDCARLPPS2_MASK                         0x4
#define _MD1CARLPPS_MDCARLPPS3_POSN                         0x3
#define _MD1CARLPPS_MDCARLPPS3_POSITION                     0x3
#define _MD1CARLPPS_MDCARLPPS3_SIZE                         0x1
#define _MD1CARLPPS_MDCARLPPS3_LENGTH                       0x1
#define _MD1CARLPPS_MDCARLPPS3_MASK                         0x8
#define _MD1CARLPPS_MDCARLPPS4_POSN                         0x4
#define _MD1CARLPPS_MDCARLPPS4_POSITION                     0x4
#define _MD1CARLPPS_MDCARLPPS4_SIZE                         0x1
#define _MD1CARLPPS_MDCARLPPS4_LENGTH                       0x1
#define _MD1CARLPPS_MDCARLPPS4_MASK                         0x10
#define _MD1CARLPPS_MDCARLPPS_POSN                          0x0
#define _MD1CARLPPS_MDCARLPPS_POSITION                      0x0
#define _MD1CARLPPS_MDCARLPPS_SIZE                          0x5
#define _MD1CARLPPS_MDCARLPPS_LENGTH                        0x5
#define _MD1CARLPPS_MDCARLPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARLPPS0             :1;
        unsigned MDCARLPPS1             :1;
        unsigned MDCARLPPS2             :1;
        unsigned MDCARLPPS3             :1;
        unsigned MDCARLPPS4             :1;
    };
    struct {
        unsigned MDCARLPPS              :5;
    };
} MDCARLPPSbits_t;
