GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
// Register: U3BRG
#define U3BRG U3BRG
extern volatile unsigned short          U3BRG               __at(0x2D4);
#ifndef _LIB_BUILD
asm("U3BRG equ 02D4h");
#endif

// Register: U3BRGL
#define U3BRGL U3BRGL
extern volatile unsigned char           U3BRGL              __at(0x2D4);
#ifndef _LIB_BUILD
asm("U3BRGL equ 02D4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U3BRGLbits_t;
extern volatile U3BRGLbits_t U3BRGLbits __at(0x2D4);
// bitfield macros
#define _U3BRGL_BRGL_POSN                                   0x0
#define _U3BRGL_BRGL_POSITION                               0x0
#define _U3BRGL_BRGL_SIZE                                   0x8
#define _U3BRGL_BRGL_LENGTH                                 0x8
#define _U3BRGL_BRGL_MASK                                   0xFF

// Register: U3BRGH
#define U3BRGH U3BRGH
extern volatile unsigned char           U3BRGH              __at(0x2D5);
#ifndef _LIB_BUILD
asm("U3BRGH equ 02D5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U3BRGHbits_t;
extern volatile U3BRGHbits_t U3BRGHbits __at(0x2D5);
// bitfield macros
#define _U3BRGH_BRGH_POSN                                   0x0
#define _U3BRGH_BRGH_POSITION                               0x0
#define _U3BRGH_BRGH_SIZE                                   0x8
#define _U3BRGH_BRGH_LENGTH                                 0x8
#define _U3BRGH_BRGH_MASK                                   0xFF

// Register: U3FIFO
#define U3FIFO U3FIFO
extern volatile unsigned char           U3FIFO              __at(0x2D6);
#ifndef _LIB_BUILD
asm("U3FIFO equ 02D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U3RXBF                 :1;
        unsigned U3RXBE                 :1;
        unsigned U3XON                  :1;
        unsigned U3RXIDL                :1;
        unsigned U3TXBF                 :1;
        unsigned U3TXBE                 :1;
        unsigned U3STPMD                :1;
        unsigned U3TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U3RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U3FIFObits_t;
extern volatile U3FIFObits_t U3FIFObits __at(0x2D6);
// bitfield macros
#define _U3FIFO_RXBF_POSN                                   0x0
#define _U3FIFO_RXBF_POSITION                               0x0
#define _U3FIFO_RXBF_SIZE                                   0x1
#define _U3FIFO_RXBF_LENGTH                                 0x1
#define _U3FIFO_RXBF_MASK                                   0x1
#define _U3FIFO_RXBE_POSN                                   0x1
#define _U3FIFO_RXBE_POSITION                               0x1
#define _U3FIFO_RXBE_SIZE                                   0x1
#define _U3FIFO_RXBE_LENGTH                                 0x1
#define _U3FIFO_RXBE_MASK                                   0x2
#define _U3FIFO_XON_POSN                                    0x2
#define _U3FIFO_XON_POSITION                                0x2
#define _U3FIFO_XON_SIZE                                    0x1
#define _U3FIFO_XON_LENGTH                                  0x1
#define _U3FIFO_XON_MASK                                    0x4
#define _U3FIFO_RXIDL_POSN                                  0x3
#define _U3FIFO_RXIDL_POSITION                              0x3
#define _U3FIFO_RXIDL_SIZE                                  0x1
#define _U3FIFO_RXIDL_LENGTH                                0x1
#define _U3FIFO_RXIDL_MASK                                  0x8
#define _U3FIFO_TXBF_POSN                                   0x4
#define _U3FIFO_TXBF_POSITION                               0x4
#define _U3FIFO_TXBF_SIZE                                   0x1
#define _U3FIFO_TXBF_LENGTH                                 0x1
#define _U3FIFO_TXBF_MASK                                   0x10
#define _U3FIFO_TXBE_POSN                                   0x5
#define _U3FIFO_TXBE_POSITION                               0x5
#define _U3FIFO_TXBE_SIZE                                   0x1
#define _U3FIFO_TXBE_LENGTH                                 0x1
#define _U3FIFO_TXBE_MASK                                   0x20
#define _U3FIFO_STPMD_POSN                                  0x6
#define _U3FIFO_STPMD_POSITION                              0x6
#define _U3FIFO_STPMD_SIZE                                  0x1
#define _U3FIFO_STPMD_LENGTH                                0x1
#define _U3FIFO_STPMD_MASK                                  0x40
#define _U3FIFO_TXWRE_POSN                                  0x7
#define _U3FIFO_TXWRE_POSITION                              0x7
#define _U3FIFO_TXWRE_SIZE                                  0x1
#define _U3FIFO_TXWRE_LENGTH                                0x1
#define _U3FIFO_TXWRE_MASK                                  0x80
#define _U3FIFO_U3RXBF_POSN                                 0x0
#define _U3FIFO_U3RXBF_POSITION                             0x0
#define _U3FIFO_U3RXBF_SIZE                                 0x1
#define _U3FIFO_U3RXBF_LENGTH                               0x1
#define _U3FIFO_U3RXBF_MASK                                 0x1
#define _U3FIFO_U3RXBE_POSN                                 0x1
#define _U3FIFO_U3RXBE_POSITION                             0x1
#define _U3FIFO_U3RXBE_SIZE                                 0x1
#define _U3FIFO_U3RXBE_LENGTH                               0x1
#define _U3FIFO_U3RXBE_MASK                                 0x2
#define _U3FIFO_U3XON_POSN                                  0x2
#define _U3FIFO_U3XON_POSITION                              0x2
#define _U3FIFO_U3XON_SIZE                                  0x1
#define _U3FIFO_U3XON_LENGTH                                0x1
#define _U3FIFO_U3XON_MASK                                  0x4
#define _U3FIFO_U3RXIDL_POSN                                0x3
#define _U3FIFO_U3RXIDL_POSITION                            0x3
#define _U3FIFO_U3RXIDL_SIZE                                0x1
#define _U3FIFO_U3RXIDL_LENGTH                              0x1
#define _U3FIFO_U3RXIDL_MASK                                0x8
#define _U3FIFO_U3TXBF_POSN                                 0x4
#define _U3FIFO_U3TXBF_POSITION                             0x4
#define _U3FIFO_U3TXBF_SIZE                                 0x1
#define _U3FIFO_U3TXBF_LENGTH                               0x1
#define _U3FIFO_U3TXBF_MASK                                 0x10
#define _U3FIFO_U3TXBE_POSN                                 0x5
#define _U3FIFO_U3TXBE_POSITION                             0x5
#define _U3FIFO_U3TXBE_SIZE                                 0x1
#define _U3FIFO_U3TXBE_LENGTH                               0x1
#define _U3FIFO_U3TXBE_MASK                                 0x20
#define _U3FIFO_U3STPMD_POSN                                0x6
#define _U3FIFO_U3STPMD_POSITION                            0x6
#define _U3FIFO_U3STPMD_SIZE                                0x1
#define _U3FIFO_U3STPMD_LENGTH                              0x1
#define _U3FIFO_U3STPMD_MASK                                0x40
#define _U3FIFO_U3TXWRE_POSN                                0x7
#define _U3FIFO_U3TXWRE_POSITION                            0x7
#define _U3FIFO_U3TXWRE_SIZE                                0x1
#define _U3FIFO_U3TXWRE_LENGTH                              0x1
#define _U3FIFO_U3TXWRE_MASK                                0x80
#define _U3FIFO_U3RCIDL_POSN                                0x3
#define _U3FIFO_U3RCIDL_POSITION                            0x3
#define _U3FIFO_U3RCIDL_SIZE                                0x1
#define _U3FIFO_U3RCIDL_LENGTH                              0x1
#define _U3FIFO_U3RCIDL_MASK                                0x8
#define _U3FIFO_RCIDL_POSN                                  0x3
#define _U3FIFO_RCIDL_POSITION                              0x3
#define _U3FIFO_RCIDL_SIZE                                  0x1
#define _U3FIFO_RCIDL_LENGTH                                0x1
#define _U3FIFO_RCIDL_MASK                                  0x8

