GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
// Register: IVTBASE
#define IVTBASE IVTBASE
#ifndef __CCI__
extern volatile __uint24                IVTBASE             __at(0x45D);
#endif
#ifndef _LIB_BUILD
asm("IVTBASE equ 045Dh");
#endif

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
extern volatile unsigned char           IVTBASEL            __at(0x45D);
#ifndef _LIB_BUILD
asm("IVTBASEL equ 045Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE0                  :1;
        unsigned BASE1                  :1;
        unsigned BASE2                  :1;
        unsigned BASE3                  :1;
        unsigned BASE4                  :1;
        unsigned BASE5                  :1;
        unsigned BASE6                  :1;
        unsigned BASE7                  :1;
    };
} IVTBASELbits_t;
extern volatile IVTBASELbits_t IVTBASELbits __at(0x45D);
// bitfield macros
#define _IVTBASEL_BASE0_POSN                                0x0
#define _IVTBASEL_BASE0_POSITION                            0x0
#define _IVTBASEL_BASE0_SIZE                                0x1
#define _IVTBASEL_BASE0_LENGTH                              0x1
#define _IVTBASEL_BASE0_MASK                                0x1
#define _IVTBASEL_BASE1_POSN                                0x1
#define _IVTBASEL_BASE1_POSITION                            0x1
#define _IVTBASEL_BASE1_SIZE                                0x1
#define _IVTBASEL_BASE1_LENGTH                              0x1
#define _IVTBASEL_BASE1_MASK                                0x2
#define _IVTBASEL_BASE2_POSN                                0x2
#define _IVTBASEL_BASE2_POSITION                            0x2
#define _IVTBASEL_BASE2_SIZE                                0x1
#define _IVTBASEL_BASE2_LENGTH                              0x1
#define _IVTBASEL_BASE2_MASK                                0x4
#define _IVTBASEL_BASE3_POSN                                0x3
#define _IVTBASEL_BASE3_POSITION                            0x3
#define _IVTBASEL_BASE3_SIZE                                0x1
#define _IVTBASEL_BASE3_LENGTH                              0x1
#define _IVTBASEL_BASE3_MASK                                0x8
#define _IVTBASEL_BASE4_POSN                                0x4
#define _IVTBASEL_BASE4_POSITION                            0x4
#define _IVTBASEL_BASE4_SIZE                                0x1
#define _IVTBASEL_BASE4_LENGTH                              0x1
#define _IVTBASEL_BASE4_MASK                                0x10
#define _IVTBASEL_BASE5_POSN                                0x5
#define _IVTBASEL_BASE5_POSITION                            0x5
#define _IVTBASEL_BASE5_SIZE                                0x1
#define _IVTBASEL_BASE5_LENGTH                              0x1
#define _IVTBASEL_BASE5_MASK                                0x20
#define _IVTBASEL_BASE6_POSN                                0x6
#define _IVTBASEL_BASE6_POSITION                            0x6
#define _IVTBASEL_BASE6_SIZE                                0x1
#define _IVTBASEL_BASE6_LENGTH                              0x1
#define _IVTBASEL_BASE6_MASK                                0x40
#define _IVTBASEL_BASE7_POSN                                0x7
#define _IVTBASEL_BASE7_POSITION                            0x7
#define _IVTBASEL_BASE7_SIZE                                0x1
#define _IVTBASEL_BASE7_LENGTH                              0x1
#define _IVTBASEL_BASE7_MASK                                0x80

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
extern volatile unsigned char           IVTBASEH            __at(0x45E);
#ifndef _LIB_BUILD
asm("IVTBASEH equ 045Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE8                  :1;
        unsigned BASE9                  :1;
        unsigned BASE10                 :1;
        unsigned BASE11                 :1;
        unsigned BASE12                 :1;
        unsigned BASE13                 :1;
        unsigned BASE14                 :1;
        unsigned BASE15                 :1;
    };
} IVTBASEHbits_t;
extern volatile IVTBASEHbits_t IVTBASEHbits __at(0x45E);
// bitfield macros
#define _IVTBASEH_BASE8_POSN                                0x0
#define _IVTBASEH_BASE8_POSITION                            0x0
#define _IVTBASEH_BASE8_SIZE                                0x1
#define _IVTBASEH_BASE8_LENGTH                              0x1
#define _IVTBASEH_BASE8_MASK                                0x1
#define _IVTBASEH_BASE9_POSN                                0x1
#define _IVTBASEH_BASE9_POSITION                            0x1
#define _IVTBASEH_BASE9_SIZE                                0x1
#define _IVTBASEH_BASE9_LENGTH                              0x1
#define _IVTBASEH_BASE9_MASK                                0x2
#define _IVTBASEH_BASE10_POSN                               0x2
#define _IVTBASEH_BASE10_POSITION                           0x2
#define _IVTBASEH_BASE10_SIZE                               0x1
#define _IVTBASEH_BASE10_LENGTH                             0x1
#define _IVTBASEH_BASE10_MASK                               0x4
#define _IVTBASEH_BASE11_POSN                               0x3
#define _IVTBASEH_BASE11_POSITION                           0x3
#define _IVTBASEH_BASE11_SIZE                               0x1
#define _IVTBASEH_BASE11_LENGTH                             0x1
#define _IVTBASEH_BASE11_MASK                               0x8
#define _IVTBASEH_BASE12_POSN                               0x4
#define _IVTBASEH_BASE12_POSITION                           0x4
#define _IVTBASEH_BASE12_SIZE                               0x1
#define _IVTBASEH_BASE12_LENGTH                             0x1
#define _IVTBASEH_BASE12_MASK                               0x10
#define _IVTBASEH_BASE13_POSN                               0x5
#define _IVTBASEH_BASE13_POSITION                           0x5
#define _IVTBASEH_BASE13_SIZE                               0x1
#define _IVTBASEH_BASE13_LENGTH                             0x1
#define _IVTBASEH_BASE13_MASK                               0x20
#define _IVTBASEH_BASE14_POSN                               0x6
#define _IVTBASEH_BASE14_POSITION                           0x6
#define _IVTBASEH_BASE14_SIZE                               0x1
#define _IVTBASEH_BASE14_LENGTH                             0x1
#define _IVTBASEH_BASE14_MASK                               0x40
#define _IVTBASEH_BASE15_POSN                               0x7
#define _IVTBASEH_BASE15_POSITION                           0x7
#define _IVTBASEH_BASE15_SIZE                               0x1
#define _IVTBASEH_BASE15_LENGTH                             0x1
#define _IVTBASEH_BASE15_MASK                               0x80

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
extern volatile unsigned char           IVTBASEU            __at(0x45F);
#ifndef _LIB_BUILD
asm("IVTBASEU equ 045Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE16                 :1;
        unsigned BASE17                 :1;
        unsigned BASE18                 :1;
        unsigned BASE19                 :1;
        unsigned BASE20                 :1;
    };
} IVTBASEUbits_t;
