GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
// Register: PIE13
#define PIE13 PIE13
extern volatile unsigned char           PIE13               __at(0x4AB);
#ifndef _LIB_BUILD
asm("PIE13 equ 04ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U5RXIE                 :1;
        unsigned U5TXIE                 :1;
        unsigned U5EIE                  :1;
        unsigned U5IE                   :1;
        unsigned DMA6SCNTIE             :1;
        unsigned DMA6DCNTIE             :1;
        unsigned DMA6ORIE               :1;
        unsigned DMA6AIE                :1;
    };
} PIE13bits_t;
extern volatile PIE13bits_t PIE13bits __at(0x4AB);
// bitfield macros
#define _PIE13_U5RXIE_POSN                                  0x0
#define _PIE13_U5RXIE_POSITION                              0x0
#define _PIE13_U5RXIE_SIZE                                  0x1
#define _PIE13_U5RXIE_LENGTH                                0x1
#define _PIE13_U5RXIE_MASK                                  0x1
#define _PIE13_U5TXIE_POSN                                  0x1
#define _PIE13_U5TXIE_POSITION                              0x1
#define _PIE13_U5TXIE_SIZE                                  0x1
#define _PIE13_U5TXIE_LENGTH                                0x1
#define _PIE13_U5TXIE_MASK                                  0x2
#define _PIE13_U5EIE_POSN                                   0x2
#define _PIE13_U5EIE_POSITION                               0x2
#define _PIE13_U5EIE_SIZE                                   0x1
#define _PIE13_U5EIE_LENGTH                                 0x1
#define _PIE13_U5EIE_MASK                                   0x4
#define _PIE13_U5IE_POSN                                    0x3
#define _PIE13_U5IE_POSITION                                0x3
#define _PIE13_U5IE_SIZE                                    0x1
#define _PIE13_U5IE_LENGTH                                  0x1
#define _PIE13_U5IE_MASK                                    0x8
#define _PIE13_DMA6SCNTIE_POSN                              0x4
#define _PIE13_DMA6SCNTIE_POSITION                          0x4
#define _PIE13_DMA6SCNTIE_SIZE                              0x1
#define _PIE13_DMA6SCNTIE_LENGTH                            0x1
#define _PIE13_DMA6SCNTIE_MASK                              0x10
#define _PIE13_DMA6DCNTIE_POSN                              0x5
#define _PIE13_DMA6DCNTIE_POSITION                          0x5
#define _PIE13_DMA6DCNTIE_SIZE                              0x1
#define _PIE13_DMA6DCNTIE_LENGTH                            0x1
#define _PIE13_DMA6DCNTIE_MASK                              0x20
#define _PIE13_DMA6ORIE_POSN                                0x6
#define _PIE13_DMA6ORIE_POSITION                            0x6
#define _PIE13_DMA6ORIE_SIZE                                0x1
#define _PIE13_DMA6ORIE_LENGTH                              0x1
#define _PIE13_DMA6ORIE_MASK                                0x40
#define _PIE13_DMA6AIE_POSN                                 0x7
#define _PIE13_DMA6AIE_POSITION                             0x7
#define _PIE13_DMA6AIE_SIZE                                 0x1
#define _PIE13_DMA6AIE_LENGTH                               0x1
#define _PIE13_DMA6AIE_MASK                                 0x80

// Register: PIE14
#define PIE14 PIE14
extern volatile unsigned char           PIE14               __at(0x4AC);
#ifndef _LIB_BUILD
asm("PIE14 equ 04ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC7IE                 :1;
        unsigned C2IE                   :1;
        unsigned NCO3IE                 :1;
    };
} PIE14bits_t;
extern volatile PIE14bits_t PIE14bits __at(0x4AC);
// bitfield macros
#define _PIE14_CLC7IE_POSN                                  0x1
#define _PIE14_CLC7IE_POSITION                              0x1
#define _PIE14_CLC7IE_SIZE                                  0x1
#define _PIE14_CLC7IE_LENGTH                                0x1
#define _PIE14_CLC7IE_MASK                                  0x2
#define _PIE14_C2IE_POSN                                    0x2
#define _PIE14_C2IE_POSITION                                0x2
#define _PIE14_C2IE_SIZE                                    0x1
#define _PIE14_C2IE_LENGTH                                  0x1
#define _PIE14_C2IE_MASK                                    0x4
#define _PIE14_NCO3IE_POSN                                  0x3
#define _PIE14_NCO3IE_POSITION                              0x3
#define _PIE14_NCO3IE_SIZE                                  0x1
#define _PIE14_NCO3IE_LENGTH                                0x1
#define _PIE14_NCO3IE_MASK                                  0x8

// Register: PIE15
#define PIE15 PIE15
extern volatile unsigned char           PIE15               __at(0x4AD);
#ifndef _LIB_BUILD
asm("PIE15 equ 04ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIE                  :1;
        unsigned CLC8IE                 :1;
        unsigned CRCIE                  :1;
        unsigned TMR6IE                 :1;
    };
} PIE15bits_t;
extern volatile PIE15bits_t PIE15bits __at(0x4AD);
// bitfield macros
#define _PIE15_NVMIE_POSN                                   0x0
#define _PIE15_NVMIE_POSITION                               0x0
#define _PIE15_NVMIE_SIZE                                   0x1
#define _PIE15_NVMIE_LENGTH                                 0x1
#define _PIE15_NVMIE_MASK                                   0x1
#define _PIE15_CLC8IE_POSN                                  0x1
#define _PIE15_CLC8IE_POSITION                              0x1
#define _PIE15_CLC8IE_SIZE                                  0x1
#define _PIE15_CLC8IE_LENGTH                                0x1
#define _PIE15_CLC8IE_MASK                                  0x2
#define _PIE15_CRCIE_POSN                                   0x2
#define _PIE15_CRCIE_POSITION                               0x2
#define _PIE15_CRCIE_SIZE                                   0x1
#define _PIE15_CRCIE_LENGTH                                 0x1
#define _PIE15_CRCIE_MASK                                   0x4
#define _PIE15_TMR6IE_POSN                                  0x3
#define _PIE15_TMR6IE_POSITION                              0x3
#define _PIE15_TMR6IE_SIZE                                  0x1
#define _PIE15_TMR6IE_LENGTH                                0x1
#define _PIE15_TMR6IE_MASK                                  0x8

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x4AE);
#ifndef _LIB_BUILD
asm("PIR0 equ 04AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned                        :1;
        unsigned CLC1IF                 :1;
        unsigned                        :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x4AE);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_HLVDIF_POSN                                   0x1
#define _PIR0_HLVDIF_POSITION                               0x1
#define _PIR0_HLVDIF_SIZE                                   0x1
#define _PIR0_HLVDIF_LENGTH                                 0x1
#define _PIR0_HLVDIF_MASK                                   0x2
#define _PIR0_OSFIF_POSN                                    0x2
#define _PIR0_OSFIF_POSITION                                0x2
#define _PIR0_OSFIF_SIZE                                    0x1
#define _PIR0_OSFIF_LENGTH                                  0x1
#define _PIR0_OSFIF_MASK                                    0x4
#define _PIR0_CSWIF_POSN                                    0x3
#define _PIR0_CSWIF_POSITION                                0x3
#define _PIR0_CSWIF_SIZE                                    0x1
#define _PIR0_CSWIF_LENGTH                                  0x1
#define _PIR0_CSWIF_MASK                                    0x8
#define _PIR0_CLC1IF_POSN                                   0x5
#define _PIR0_CLC1IF_POSITION                               0x5
#define _PIR0_CLC1IF_SIZE                                   0x1
#define _PIR0_CLC1IF_LENGTH                                 0x1
#define _PIR0_CLC1IF_MASK                                   0x20
#define _PIR0_IOCIF_POSN                                    0x7
#define _PIR0_IOCIF_POSITION                                0x7
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x4AF);
#ifndef _LIB_BUILD
asm("PIR1 equ 04AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ZCDIF                  :1;
        unsigned ADIF                   :1;
        unsigned ACTIF                  :1;
        unsigned C1IF                   :1;
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x4AF);
// bitfield macros
#define _PIR1_INT0IF_POSN                                   0x0
#define _PIR1_INT0IF_POSITION                               0x0
#define _PIR1_INT0IF_SIZE                                   0x1
#define _PIR1_INT0IF_LENGTH                                 0x1
#define _PIR1_INT0IF_MASK                                   0x1
#define _PIR1_ZCDIF_POSN                                    0x1
#define _PIR1_ZCDIF_POSITION                                0x1
#define _PIR1_ZCDIF_SIZE                                    0x1
#define _PIR1_ZCDIF_LENGTH                                  0x1
#define _PIR1_ZCDIF_MASK                                    0x2
#define _PIR1_ADIF_POSN                                     0x2
#define _PIR1_ADIF_POSITION                                 0x2
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x4
#define _PIR1_ACTIF_POSN                                    0x3
#define _PIR1_ACTIF_POSITION                                0x3
#define _PIR1_ACTIF_SIZE                                    0x1
#define _PIR1_ACTIF_LENGTH                                  0x1
#define _PIR1_ACTIF_MASK                                    0x8
#define _PIR1_C1IF_POSN                                     0x4
#define _PIR1_C1IF_POSITION                                 0x4
#define _PIR1_C1IF_SIZE                                     0x1
#define _PIR1_C1IF_LENGTH                                   0x1
#define _PIR1_C1IF_MASK                                     0x10
#define _PIR1_SMT1IF_POSN                                   0x5
#define _PIR1_SMT1IF_POSITION                               0x5
#define _PIR1_SMT1IF_SIZE                                   0x1
#define _PIR1_SMT1IF_LENGTH                                 0x1
#define _PIR1_SMT1IF_MASK                                   0x20
#define _PIR1_SMT1PRAIF_POSN                                0x6
#define _PIR1_SMT1PRAIF_POSITION                            0x6
#define _PIR1_SMT1PRAIF_SIZE                                0x1
#define _PIR1_SMT1PRAIF_LENGTH                              0x1
#define _PIR1_SMT1PRAIF_MASK                                0x40
#define _PIR1_SMT1PWAIF_POSN                                0x7
#define _PIR1_SMT1PWAIF_POSITION                            0x7
#define _PIR1_SMT1PWAIF_SIZE                                0x1
#define _PIR1_SMT1PWAIF_LENGTH                              0x1
#define _PIR1_SMT1PWAIF_MASK                                0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x4B0);
#ifndef _LIB_BUILD
asm("PIR2 equ 04B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADTIF                  :1;
        unsigned                        :3;
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x4B0);
// bitfield macros
#define _PIR2_ADTIF_POSN                                    0x0
#define _PIR2_ADTIF_POSITION                                0x0
#define _PIR2_ADTIF_SIZE                                    0x1
#define _PIR2_ADTIF_LENGTH                                  0x1
#define _PIR2_ADTIF_MASK                                    0x1
#define _PIR2_DMA1SCNTIF_POSN                               0x4
#define _PIR2_DMA1SCNTIF_POSITION                           0x4
#define _PIR2_DMA1SCNTIF_SIZE                               0x1
#define _PIR2_DMA1SCNTIF_LENGTH                             0x1
#define _PIR2_DMA1SCNTIF_MASK                               0x10
#define _PIR2_DMA1DCNTIF_POSN                               0x5
#define _PIR2_DMA1DCNTIF_POSITION                           0x5
#define _PIR2_DMA1DCNTIF_SIZE                               0x1
#define _PIR2_DMA1DCNTIF_LENGTH                             0x1
#define _PIR2_DMA1DCNTIF_MASK                               0x20
#define _PIR2_DMA1ORIF_POSN                                 0x6
#define _PIR2_DMA1ORIF_POSITION                             0x6
#define _PIR2_DMA1ORIF_SIZE                                 0x1
#define _PIR2_DMA1ORIF_LENGTH                               0x1
#define _PIR2_DMA1ORIF_MASK                                 0x40
#define _PIR2_DMA1AIF_POSN                                  0x7
#define _PIR2_DMA1AIF_POSITION                              0x7
#define _PIR2_DMA1AIF_SIZE                                  0x1
#define _PIR2_DMA1AIF_LENGTH                                0x1
#define _PIR2_DMA1AIF_MASK                                  0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x4B1);
#ifndef _LIB_BUILD
asm("PIR3 equ 04B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned CCP1IF                 :1;
        unsigned TMR0IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x4B1);
// bitfield macros
#define _PIR3_SPI1RXIF_POSN                                 0x0
#define _PIR3_SPI1RXIF_POSITION                             0x0
#define _PIR3_SPI1RXIF_SIZE                                 0x1
#define _PIR3_SPI1RXIF_LENGTH                               0x1
#define _PIR3_SPI1RXIF_MASK                                 0x1
#define _PIR3_SPI1TXIF_POSN                                 0x1
#define _PIR3_SPI1TXIF_POSITION                             0x1
#define _PIR3_SPI1TXIF_SIZE                                 0x1
#define _PIR3_SPI1TXIF_LENGTH                               0x1
#define _PIR3_SPI1TXIF_MASK                                 0x2
#define _PIR3_SPI1IF_POSN                                   0x2
#define _PIR3_SPI1IF_POSITION                               0x2
#define _PIR3_SPI1IF_SIZE                                   0x1
#define _PIR3_SPI1IF_LENGTH                                 0x1
#define _PIR3_SPI1IF_MASK                                   0x4
#define _PIR3_TMR2IF_POSN                                   0x3
#define _PIR3_TMR2IF_POSITION                               0x3
#define _PIR3_TMR2IF_SIZE                                   0x1
#define _PIR3_TMR2IF_LENGTH                                 0x1
#define _PIR3_TMR2IF_MASK                                   0x8
#define _PIR3_TMR1IF_POSN                                   0x4
#define _PIR3_TMR1IF_POSITION                               0x4
#define _PIR3_TMR1IF_SIZE                                   0x1
#define _PIR3_TMR1IF_LENGTH                                 0x1
#define _PIR3_TMR1IF_MASK                                   0x10
#define _PIR3_TMR1GIF_POSN                                  0x5
#define _PIR3_TMR1GIF_POSITION                              0x5
#define _PIR3_TMR1GIF_SIZE                                  0x1
#define _PIR3_TMR1GIF_LENGTH                                0x1
#define _PIR3_TMR1GIF_MASK                                  0x20
#define _PIR3_CCP1IF_POSN                                   0x6
#define _PIR3_CCP1IF_POSITION                               0x6
#define _PIR3_CCP1IF_SIZE                                   0x1
#define _PIR3_CCP1IF_LENGTH                                 0x1
#define _PIR3_CCP1IF_MASK                                   0x40
#define _PIR3_TMR0IF_POSN                                   0x7
#define _PIR3_TMR0IF_POSITION                               0x7
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x4B2);
#ifndef _LIB_BUILD
asm("PIR4 equ 04B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned                        :2;
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x4B2);
// bitfield macros
#define _PIR4_U1RXIF_POSN                                   0x0
#define _PIR4_U1RXIF_POSITION                               0x0
#define _PIR4_U1RXIF_SIZE                                   0x1
#define _PIR4_U1RXIF_LENGTH                                 0x1
#define _PIR4_U1RXIF_MASK                                   0x1
#define _PIR4_U1TXIF_POSN                                   0x1
#define _PIR4_U1TXIF_POSITION                               0x1
#define _PIR4_U1TXIF_SIZE                                   0x1
#define _PIR4_U1TXIF_LENGTH                                 0x1
#define _PIR4_U1TXIF_MASK                                   0x2
#define _PIR4_U1EIF_POSN                                    0x2
#define _PIR4_U1EIF_POSITION                                0x2
#define _PIR4_U1EIF_SIZE                                    0x1
#define _PIR4_U1EIF_LENGTH                                  0x1
#define _PIR4_U1EIF_MASK                                    0x4
#define _PIR4_U1IF_POSN                                     0x3
#define _PIR4_U1IF_POSITION                                 0x3
#define _PIR4_U1IF_SIZE                                     0x1
#define _PIR4_U1IF_LENGTH                                   0x1
#define _PIR4_U1IF_MASK                                     0x8
#define _PIR4_PWM1PIF_POSN                                  0x6
#define _PIR4_PWM1PIF_POSITION                              0x6
#define _PIR4_PWM1PIF_SIZE                                  0x1
#define _PIR4_PWM1PIF_LENGTH                                0x1
#define _PIR4_PWM1PIF_MASK                                  0x40
#define _PIR4_PWM1IF_POSN                                   0x7
#define _PIR4_PWM1IF_POSITION                               0x7
#define _PIR4_PWM1IF_SIZE                                   0x1
#define _PIR4_PWM1IF_LENGTH                                 0x1
#define _PIR4_PWM1IF_MASK                                   0x80

