GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x4FD);
#ifndef _LIB_BUILD
asm("TOSL equ 04FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x4FD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x4FE);
#ifndef _LIB_BUILD
asm("TOSH equ 04FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x4FE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x4FF);
#ifndef _LIB_BUILD
asm("TOSU equ 04FFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: CCPR1L
#define                                 CCPR1L_M1           0x4000
// Register: CCPR1H
#define                                 CCPR1H_M1           0x4001
// Register: CCPR2L
#define                                 CCPR2L_M1           0x4002
// Register: CCPR2H
#define                                 CCPR2H_M1           0x4003
// Register: CCPR3L
#define                                 CCPR3L_M1           0x4004
// Register: CCPR3H
#define                                 CCPR3H_M1           0x4005
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M1        0x4006
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M1        0x4007
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M1        0x4008
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M1        0x4009
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M1        0x400A
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M1        0x400B
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M2        0x4010
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M2        0x4011
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M1        0x4012
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M1        0x4013
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M2        0x4014
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M2        0x4015
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M1        0x4016
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M1        0x4017
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M2        0x4018
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M2        0x4019
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M1        0x401A
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M1        0x401B
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M3        0x4020
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M3        0x4021
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M2        0x4022
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M2        0x4023
// Register: PWM1PRL
#define                                 PWM1PRL_M1          0x4024
// Register: PWM1PRH
#define                                 PWM1PRH_M1          0x4025
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M3        0x4026
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M3        0x4027
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M2        0x4028
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M2        0x4029
// Register: PWM2PRL
#define                                 PWM2PRL_M1          0x402A
// Register: PWM2PRH
#define                                 PWM2PRH_M1          0x402B
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M3        0x402C
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M3        0x402D
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M2        0x402E
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M2        0x402F
// Register: PWM3PRL
#define                                 PWM3PRL_M1          0x4030
// Register: PWM3PRH
#define                                 PWM3PRH_M1          0x4031
// Register: CCPR1L
#define                                 CCPR1L_M2           0x4040
// Register: CCPR1H
#define                                 CCPR1H_M2           0x4041
// Register: T2PR
#define                                 T2PR_M1             0x4042
// Register: CCPR2L
#define                                 CCPR2L_M2           0x4043
// Register: CCPR2H
#define                                 CCPR2H_M2           0x4044
// Register: T4PR
#define                                 T4PR_M1             0x4045
// Register: CCPR3L
#define                                 CCPR3L_M2           0x4046
// Register: CCPR3H
#define                                 CCPR3H_M2           0x4047
// Register: T6PR
#define                                 T6PR_M1             0x4048
// Register: ADLTHL
#define                                 ADLTHL_M1           0x4060
// Register: ADLTHH
#define                                 ADLTHH_M1           0x4061
// Register: ADUTHL
#define                                 ADUTHL_M1           0x4062
// Register: ADUTHH
#define                                 ADUTHH_M1           0x4063
// Register: ADERRL
#define                                 ADERRL_M1           0x4064
// Register: ADERRH
#define                                 ADERRH_M1           0x4065
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x4066
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x4067
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x4068
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x4069
// Register: ADACCL
#define                                 ADACCL_M1           0x406A
// Register: ADACCH
#define                                 ADACCH_M1           0x406B
// Register: ADACCU
#define                                 ADACCU_M1           0x406C
// Register: ADCNT
#define                                 ADCNT_M1            0x406D
// Register: ADRPT
#define                                 ADRPT_M1            0x406E
// Register: ADPREVL
#define                                 ADPREVL_M1          0x406F
// Register: ADPREVH
#define                                 ADPREVH_M1          0x4070
// Register: ADACQL
#define                                 ADACQL_M1           0x4071
// Register: ADACQH
#define                                 ADACQH_M1           0x4072
// Register: ADCAP
#define                                 ADCAP_M1            0x4073
// Register: ADCON0
#define                                 ADCON0_M1           0x4074
// Register: ADCON1
#define                                 ADCON1_M1           0x4075
// Register: ADCON2
#define                                 ADCON2_M1           0x4076
// Register: ADCON3
#define                                 ADCON3_M1           0x4077
// Register: ADREF
#define                                 ADREF_M1            0x4078
// Register: ADACT
#define                                 ADACT_M1            0x4079
// Register: ADCLK
#define                                 ADCLK_M1            0x407A
// Register: ADPCH
#define                                 ADPCH_M1            0x407B
// Register: ADRESL
#define                                 ADRESL_M1           0x407C
// Register: ADRESH
#define                                 ADRESH_M1           0x407D
// Register: ADLTHL
#define                                 ADLTHL_M2           0x40E0
// Register: ADLTHH
#define                                 ADLTHH_M2           0x40E1
// Register: ADUTHL
#define                                 ADUTHL_M2           0x40E2
// Register: ADUTHH
#define                                 ADUTHH_M2           0x40E3
// Register: ADERRL
#define                                 ADERRL_M2           0x40E4
// Register: ADERRH
#define                                 ADERRH_M2           0x40E5
// Register: ADSTPTL
#define                                 ADSTPTL_M2          0x40E6
// Register: ADSTPTH
#define                                 ADSTPTH_M2          0x40E7
// Register: ADFLTRL
#define                                 ADFLTRL_M2          0x40E8
// Register: ADFLTRH
#define                                 ADFLTRH_M2          0x40E9
// Register: ADACCL
#define                                 ADACCL_M2           0x40EA
// Register: ADACCH
#define                                 ADACCH_M2           0x40EB
// Register: ADACCU
#define                                 ADACCU_M2           0x40EC
// Register: ADCNT
#define                                 ADCNT_M2            0x40ED
// Register: ADRPT
#define                                 ADRPT_M2            0x40EE
// Register: ADPREVL
#define                                 ADPREVL_M2          0x40EF
// Register: ADPREVH
#define                                 ADPREVH_M2          0x40F0
// Register: ADACQL
#define                                 ADACQL_M2           0x40F1
// Register: ADACQH
#define                                 ADACQH_M2           0x40F2
// Register: ADCAP
#define                                 ADCAP_M2            0x40F3
// Register: ADPCH
#define                                 ADPCH_M2            0x40F4
// Register: ADRESL
#define                                 ADRESL_M2           0x40F5
// Register: ADRESH
#define                                 ADRESH_M2           0x40F6
// Register: DMAnBUF
#define                                 DMAnBUF_DMA1        0x4100
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA1      0x4101
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA1      0x4102
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA1      0x4103
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA1      0x4104
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA1       0x4105
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA1       0x4106
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA1       0x4107
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA1       0x4108
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA1      0x4109
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA1      0x410A
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA1      0x410B
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA1      0x410C
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA1      0x410D
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA1       0x410E
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA1       0x410F
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA1       0x4110
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA1       0x4111
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA1       0x4112
// Register: DMAnCON0
#define                                 DMAnCON0_DMA1       0x4113
// Register: DMAnCON1
#define                                 DMAnCON1_DMA1       0x4114
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA1       0x4115
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA1       0x4116
// Register: DMAnBUF
#define                                 DMAnBUF_DMA2        0x4117
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA2      0x4118
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA2      0x4119
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA2      0x411A
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA2      0x411B
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA2       0x411C
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA2       0x411D
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA2       0x411E
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA2       0x411F
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA2      0x4120
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA2      0x4121
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA2      0x4122
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA2      0x4123
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA2      0x4124
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA2       0x4125
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA2       0x4126
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA2       0x4127
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA2       0x4128
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA2       0x4129
// Register: DMAnCON0
#define                                 DMAnCON0_DMA2       0x412A
// Register: DMAnCON1
#define                                 DMAnCON1_DMA2       0x412B
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA2       0x412C
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA2       0x412D
// Register: DMAnBUF
#define                                 DMAnBUF_DMA3        0x412E
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA3      0x412F
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA3      0x4130
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA3      0x4131
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA3      0x4132
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA3       0x4133
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA3       0x4134
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA3       0x4135
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA3       0x4136
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA3      0x4137
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA3      0x4138
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA3      0x4139
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA3      0x413A
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA3      0x413B
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA3       0x413C
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA3       0x413D
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA3       0x413E
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA3       0x413F
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA3       0x4140
// Register: DMAnCON0
#define                                 DMAnCON0_DMA3       0x4141
// Register: DMAnCON1
#define                                 DMAnCON1_DMA3       0x4142
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA3       0x4143
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA3       0x4144
// Register: DMAnBUF
#define                                 DMAnBUF_DMA4        0x4145
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA4      0x4146
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA4      0x4147
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA4      0x4148
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA4      0x4149
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA4       0x414A
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA4       0x414B
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA4       0x414C
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA4       0x414D
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA4      0x414E
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA4      0x414F
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA4      0x4150
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA4      0x4151
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA4      0x4152
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA4       0x4153
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA4       0x4154
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA4       0x4155
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA4       0x4156
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA4       0x4157
// Register: DMAnCON0
#define                                 DMAnCON0_DMA4       0x4158
// Register: DMAnCON1
#define                                 DMAnCON1_DMA4       0x4159
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA4       0x415A
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA4       0x415B
// Register: DMAnBUF
#define                                 DMAnBUF_DMA5        0x415C
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA5      0x415D
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA5      0x415E
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA5      0x415F
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA5      0x4160
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA5       0x4161
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA5       0x4162
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA5       0x4163
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA5       0x4164
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA5      0x4165
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA5      0x4166
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA5      0x4167
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA5      0x4168
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA5      0x4169
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA5       0x416A
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA5       0x416B
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA5       0x416C
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA5       0x416D
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA5       0x416E
// Register: DMAnCON0
#define                                 DMAnCON0_DMA5       0x416F
// Register: DMAnCON1
#define                                 DMAnCON1_DMA5       0x4170
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA5       0x4171
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA5       0x4172
// Register: DMAnBUF
#define                                 DMAnBUF_DMA6        0x4173
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA6      0x4174
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA6      0x4175
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA6      0x4176
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA6      0x4177
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA6       0x4178
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA6       0x4179
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA6       0x417A
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA6       0x417B
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA6      0x417C
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA6      0x417D
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA6      0x417E
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA6      0x417F
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA6      0x4180
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA6       0x4181
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA6       0x4182
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA6       0x4183
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA6       0x4184
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA6       0x4185
// Register: DMAnCON0
#define                                 DMAnCON0_DMA6       0x4186
// Register: DMAnCON1
#define                                 DMAnCON1_DMA6       0x4187
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA6       0x4188
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA6       0x4189
// Register: IOCAF
#define                                 IOCAF_M1            0x41E0
// Register: IOCBF
#define                                 IOCBF_M1            0x41E1
// Register: IOCCF
#define                                 IOCCF_M1            0x41E2
// Register: IOCEF
#define                                 IOCEF_M1            0x41E3
// Register: TMR1L
#define                                 TMR1L_M1            0x41F6
// Register: TMR1H
#define                                 TMR1H_M1            0x41F7
// Register: TMR3L
#define                                 TMR3L_M1            0x41F8
// Register: TMR3H
#define                                 TMR3H_M1            0x41F9
// Register: TMR5L
#define                                 TMR5L_M1            0x41FA
// Register: TMR5H
#define                                 TMR5H_M1            0x41FB
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
