GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
#define                                 CLCIN6PPS0_bit      _BIT_ACCESS(CLCIN6PPS,0)
// CLCIN6PPS<CLCIN6PPS1>
extern volatile __bit                   CLCIN6PPS1          __at(0x1339);	// @ (0x267 * 8 + 1)
#define                                 CLCIN6PPS1_bit      _BIT_ACCESS(CLCIN6PPS,1)
// CLCIN6PPS<CLCIN6PPS2>
extern volatile __bit                   CLCIN6PPS2          __at(0x133A);	// @ (0x267 * 8 + 2)
#define                                 CLCIN6PPS2_bit      _BIT_ACCESS(CLCIN6PPS,2)
// CLCIN6PPS<CLCIN6PPS3>
extern volatile __bit                   CLCIN6PPS3          __at(0x133B);	// @ (0x267 * 8 + 3)
#define                                 CLCIN6PPS3_bit      _BIT_ACCESS(CLCIN6PPS,3)
// CLCIN6PPS<CLCIN6PPS4>
extern volatile __bit                   CLCIN6PPS4          __at(0x133C);	// @ (0x267 * 8 + 4)
#define                                 CLCIN6PPS4_bit      _BIT_ACCESS(CLCIN6PPS,4)
// CLCIN7PPS<CLCIN7PPS0>
extern volatile __bit                   CLCIN7PPS0          __at(0x1340);	// @ (0x268 * 8 + 0)
#define                                 CLCIN7PPS0_bit      _BIT_ACCESS(CLCIN7PPS,0)
// CLCIN7PPS<CLCIN7PPS1>
extern volatile __bit                   CLCIN7PPS1          __at(0x1341);	// @ (0x268 * 8 + 1)
#define                                 CLCIN7PPS1_bit      _BIT_ACCESS(CLCIN7PPS,1)
// CLCIN7PPS<CLCIN7PPS2>
extern volatile __bit                   CLCIN7PPS2          __at(0x1342);	// @ (0x268 * 8 + 2)
#define                                 CLCIN7PPS2_bit      _BIT_ACCESS(CLCIN7PPS,2)
// CLCIN7PPS<CLCIN7PPS3>
extern volatile __bit                   CLCIN7PPS3          __at(0x1343);	// @ (0x268 * 8 + 3)
#define                                 CLCIN7PPS3_bit      _BIT_ACCESS(CLCIN7PPS,3)
// CLCIN7PPS<CLCIN7PPS4>
extern volatile __bit                   CLCIN7PPS4          __at(0x1344);	// @ (0x268 * 8 + 4)
#define                                 CLCIN7PPS4_bit      _BIT_ACCESS(CLCIN7PPS,4)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1D2);	// @ (0x3A * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1D3);	// @ (0x3A * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCLK<CLKRCLK4>
extern volatile __bit                   CLKRCLK4            __at(0x1D4);	// @ (0x3A * 8 + 4)
#define                                 CLKRCLK4_bit        _BIT_ACCESS(CLKRCLK,4)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1CF);	// @ (0x39 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x301);	// @ (0x60 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MD1CON1,1)
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MD1CON1,0)
// PMD3<CM1MD>
extern volatile __bit                   CM1MD               __at(0x319);	// @ (0x63 * 8 + 1)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD3,1)
// PMD3<CM2MD>
extern volatile __bit                   CM2MD               __at(0x31A);	// @ (0x63 * 8 + 2)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD3,2)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C1PIE<CNTIE>
extern volatile __bit                   CNTIE               __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNTIE_bit           _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNTIF>
extern volatile __bit                   CNTIF               __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNTIF_bit           _BIT_ACCESS(I2C1PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F9E);	// @ (0x3F3 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x574);	// @ (0xAE * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x575);	// @ (0xAE * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x576);	// @ (0xAE * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// SMT1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 CPOL_bit            _BIT_ACCESS(SMT1CON0,2)
// ADCPCON<CPON>
extern volatile __bit                   CPON                __at(0x1EC7);	// @ (0x3D8 * 8 + 7)
#define                                 CPON_bit            _BIT_ACCESS(ADCPCON,7)
// ADCPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1EC0);	// @ (0x3D8 * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(ADCPCON,0)
// SMT1STAT<CPRUP>
extern volatile __bit                   CPRUP               __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 CPRUP_bit           _BIT_ACCESS(SMT1STAT,7)
// SMT1STAT<CPWUP>
extern volatile __bit                   CPWUP               __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 CPWUP_bit           _BIT_ACCESS(SMT1STAT,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x1ABF);	// @ (0x357 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x1ABE);	// @ (0x357 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE15<CRCIE>
extern volatile __bit                   CRCIE               __at(0x256A);	// @ (0x4AD * 8 + 2)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE15,2)
// PIR15<CRCIF>
extern volatile __bit                   CRCIF               __at(0x25EA);	// @ (0x4BD * 8 + 2)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR15,2)
// IPR15<CRCIP>
extern volatile __bit                   CRCIP               __at(0x1B8A);	// @ (0x371 * 8 + 2)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR15,2)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x304);	// @ (0x60 * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0x1FAC);	// @ (0x3F5 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0x1FAD);	// @ (0x3F5 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0x1FAE);	// @ (0x3F5 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// I2C1CON1<CSD>
extern volatile __bit                   CSD                 __at(0x14A8);	// @ (0x295 * 8 + 0)
#define                                 CSD_bit             _BIT_ACCESS(I2C1CON1,0)
// SMT1CLK<CSEL0>
extern volatile __bit                   CSEL0               __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 CSEL0_bit           _BIT_ACCESS(SMT1CLK,0)
// SMT1CLK<CSEL1>
extern volatile __bit                   CSEL1               __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 CSEL1_bit           _BIT_ACCESS(SMT1CLK,1)
// SMT1CLK<CSEL2>
extern volatile __bit                   CSEL2               __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 CSEL2_bit           _BIT_ACCESS(SMT1CLK,2)
// SMT1CLK<CSEL3>
extern volatile __bit                   CSEL3               __at(0x187B);	// @ (0x30F * 8 + 3)
#define                                 CSEL3_bit           _BIT_ACCESS(SMT1CLK,3)
// I2C1CON0<CSTR>
extern volatile __bit                   CSTR                __at(0x14A4);	// @ (0x294 * 8 + 4)
#define                                 CSTR_bit            _BIT_ACCESS(I2C1CON0,4)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x57F);	// @ (0xAF * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE0<CSWIE>
extern volatile __bit                   CSWIE               __at(0x24F3);	// @ (0x49E * 8 + 3)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE0,3)
// PIR0<CSWIF>
extern volatile __bit                   CSWIF               __at(0x2573);	// @ (0x4AE * 8 + 3)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR0,3)
// IPR0<CSWIP>
extern volatile __bit                   CSWIP               __at(0x1B13);	// @ (0x362 * 8 + 3)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR0,3)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x1DE0);	// @ (0x3BC * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x1DF8);	// @ (0x3BF * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x1DF9);	// @ (0x3BF * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x1DFA);	// @ (0x3BF * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x1DFB);	// @ (0x3BF * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x1DFC);	// @ (0x3BF * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x1DFD);	// @ (0x3BF * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x1DF0);	// @ (0x3BE * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x1DF1);	// @ (0x3BE * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x1DF2);	// @ (0x3BE * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x1DF3);	// @ (0x3BE * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x1DF4);	// @ (0x3BE * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x1DF5);	// @ (0x3BE * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x1E07);	// @ (0x3C0 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE6<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x2522);	// @ (0x4A4 * 8 + 2)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x25A2);	// @ (0x4B4 * 8 + 2)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR6,2)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x1E0D);	// @ (0x3C1 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1PPS<CWG1INPPS0>
extern volatile __bit                   CWG1INPPS0          __at(0x12D8);	// @ (0x25B * 8 + 0)
#define                                 CWG1INPPS0_bit      _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1INPPS1>
extern volatile __bit                   CWG1INPPS1          __at(0x12D9);	// @ (0x25B * 8 + 1)
#define                                 CWG1INPPS1_bit      _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1INPPS2>
extern volatile __bit                   CWG1INPPS2          __at(0x12DA);	// @ (0x25B * 8 + 2)
#define                                 CWG1INPPS2_bit      _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1INPPS3>
extern volatile __bit                   CWG1INPPS3          __at(0x12DB);	// @ (0x25B * 8 + 3)
#define                                 CWG1INPPS3_bit      _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1INPPS4>
extern volatile __bit                   CWG1INPPS4          __at(0x12DC);	// @ (0x25B * 8 + 4)
#define                                 CWG1INPPS4_bit      _BIT_ACCESS(CWG1PPS,4)
// IPR6<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x1B42);	// @ (0x368 * 8 + 2)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR6,2)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x1E06);	// @ (0x3C0 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x1E12);	// @ (0x3C2 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x1E13);	// @ (0x3C2 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<CWG1LSDB0>
extern volatile __bit                   CWG1LSDB0           __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 CWG1LSDB0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSDB1>
extern volatile __bit                   CWG1LSDB1           __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 CWG1LSDB1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD4<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD4,4)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x1E00);	// @ (0x3C0 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x1E01);	// @ (0x3C0 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x1E02);	// @ (0x3C0 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x1E24);	// @ (0x3C4 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x1E25);	// @ (0x3C4 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x1E26);	// @ (0x3C4 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x1E27);	// @ (0x3C4 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x1E08);	// @ (0x3C1 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x1E09);	// @ (0x3C1 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x1E0A);	// @ (0x3C1 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x1E0B);	// @ (0x3C1 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x1E20);	// @ (0x3C4 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x1E21);	// @ (0x3C4 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x1E22);	// @ (0x3C4 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x1E23);	// @ (0x3C4 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLK<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x1E28);	// @ (0x3C5 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLK,0)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x1E40);	// @ (0x3C8 * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x1E41);	// @ (0x3C8 * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x1E42);	// @ (0x3C8 * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x1E43);	// @ (0x3C8 * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x1E44);	// @ (0x3C8 * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x1E45);	// @ (0x3C8 * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x1E38);	// @ (0x3C7 * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x1E39);	// @ (0x3C7 * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x1E3A);	// @ (0x3C7 * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x1E3B);	// @ (0x3C7 * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x1E3C);	// @ (0x3C7 * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x1E3D);	// @ (0x3C7 * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x1E4F);	// @ (0x3C9 * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE10<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x2542);	// @ (0x4A8 * 8 + 2)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE10,2)
// PIR10<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0x25C2);	// @ (0x4B8 * 8 + 2)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR10,2)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x1E55);	// @ (0x3CA * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// CWG2PPS<CWG2INPPS0>
extern volatile __bit                   CWG2INPPS0          __at(0x12E0);	// @ (0x25C * 8 + 0)
#define                                 CWG2INPPS0_bit      _BIT_ACCESS(CWG2PPS,0)
