GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.h
#define                                 U1RXIE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x2590);	// @ (0x4B2 * 8 + 0)
#define                                 U1RXIF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x1B30);	// @ (0x366 * 8 + 0)
#define                                 U1RXIP_bit          _BIT_ACCESS(IPR4,0)
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0x156E);	// @ (0x2AD * 8 + 6)
#define                                 U1RXPOL_bit         _BIT_ACCESS(U1CON2,6)
// U1RXPPS<U1RXPPS0>
extern volatile __bit                   U1RXPPS0            __at(0x1390);	// @ (0x272 * 8 + 0)
#define                                 U1RXPPS0_bit        _BIT_ACCESS(U1RXPPS,0)
// U1RXPPS<U1RXPPS1>
extern volatile __bit                   U1RXPPS1            __at(0x1391);	// @ (0x272 * 8 + 1)
#define                                 U1RXPPS1_bit        _BIT_ACCESS(U1RXPPS,1)
// U1RXPPS<U1RXPPS2>
extern volatile __bit                   U1RXPPS2            __at(0x1392);	// @ (0x272 * 8 + 2)
#define                                 U1RXPPS2_bit        _BIT_ACCESS(U1RXPPS,2)
// U1RXPPS<U1RXPPS3>
extern volatile __bit                   U1RXPPS3            __at(0x1393);	// @ (0x272 * 8 + 3)
#define                                 U1RXPPS3_bit        _BIT_ACCESS(U1RXPPS,3)
// U1RXPPS<U1RXPPS4>
extern volatile __bit                   U1RXPPS4            __at(0x1394);	// @ (0x272 * 8 + 4)
#define                                 U1RXPPS4_bit        _BIT_ACCESS(U1RXPPS,4)
// U1RXPPS<U1RXPPS5>
extern volatile __bit                   U1RXPPS5            __at(0x1395);	// @ (0x272 * 8 + 5)
#define                                 U1RXPPS5_bit        _BIT_ACCESS(U1RXPPS,5)
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0x1560);	// @ (0x2AC * 8 + 0)
#define                                 U1SENDB_bit         _BIT_ACCESS(U1CON1,0)
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0x156C);	// @ (0x2AD * 8 + 4)
#define                                 U1STP0_bit          _BIT_ACCESS(U1CON2,4)
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0x156D);	// @ (0x2AD * 8 + 5)
#define                                 U1STP1_bit          _BIT_ACCESS(U1CON2,5)
// U1FIFO<U1STPMD>
extern volatile __bit                   U1STPMD             __at(0x1586);	// @ (0x2B0 * 8 + 6)
#define                                 U1STPMD_bit         _BIT_ACCESS(U1FIFO,6)
// U1FIFO<U1TXBE>
extern volatile __bit                   U1TXBE              __at(0x1585);	// @ (0x2B0 * 8 + 5)
#define                                 U1TXBE_bit          _BIT_ACCESS(U1FIFO,5)
// U1FIFO<U1TXBF>
extern volatile __bit                   U1TXBF              __at(0x1584);	// @ (0x2B0 * 8 + 4)
#define                                 U1TXBF_bit          _BIT_ACCESS(U1FIFO,4)
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0x1598);	// @ (0x2B3 * 8 + 0)
#define                                 U1TXCIE_bit         _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0x1590);	// @ (0x2B2 * 8 + 0)
#define                                 U1TXCIF_bit         _BIT_ACCESS(U1ERRIR,0)
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0x155D);	// @ (0x2AB * 8 + 5)
#define                                 U1TXEN_bit          _BIT_ACCESS(U1CON0,5)
// PIE4<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x2511);	// @ (0x4A2 * 8 + 1)
#define                                 U1TXIE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x2591);	// @ (0x4B2 * 8 + 1)
#define                                 U1TXIF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<U1TXIP>
extern volatile __bit                   U1TXIP              __at(0x1B31);	// @ (0x366 * 8 + 1)
#define                                 U1TXIP_bit          _BIT_ACCESS(IPR4,1)
// U1ERRIE<U1TXMTIE>
extern volatile __bit                   U1TXMTIE            __at(0x159F);	// @ (0x2B3 * 8 + 7)
#define                                 U1TXMTIE_bit        _BIT_ACCESS(U1ERRIE,7)
// U1ERRIR<U1TXMTIF>
extern volatile __bit                   U1TXMTIF            __at(0x1597);	// @ (0x2B2 * 8 + 7)
#define                                 U1TXMTIF_bit        _BIT_ACCESS(U1ERRIR,7)
// U1CON2<U1TXPOL>
extern volatile __bit                   U1TXPOL             __at(0x156A);	// @ (0x2AD * 8 + 2)
#define                                 U1TXPOL_bit         _BIT_ACCESS(U1CON2,2)
// U1FIFO<U1TXWRE>
extern volatile __bit                   U1TXWRE             __at(0x1587);	// @ (0x2B0 * 8 + 7)
#define                                 U1TXWRE_bit         _BIT_ACCESS(U1FIFO,7)
// U1CON1<U1WUE>
extern volatile __bit                   U1WUE               __at(0x1564);	// @ (0x2AC * 8 + 4)
#define                                 U1WUE_bit           _BIT_ACCESS(U1CON1,4)
// U1UIR<U1WUIF>
extern volatile __bit                   U1WUIF              __at(0x158F);	// @ (0x2B1 * 8 + 7)
#define                                 U1WUIF_bit          _BIT_ACCESS(U1UIR,7)
// U1FIFO<U1XON>
extern volatile __bit                   U1XON               __at(0x1582);	// @ (0x2B0 * 8 + 2)
#define                                 U1XON_bit           _BIT_ACCESS(U1FIFO,2)
// U2CON0<U2ABDEN>
extern volatile __bit                   U2ABDEN             __at(0x15F6);	// @ (0x2BE * 8 + 6)
#define                                 U2ABDEN_bit         _BIT_ACCESS(U2CON0,6)
// U2UIR<U2ABDIE>
extern volatile __bit                   U2ABDIE             __at(0x1622);	// @ (0x2C4 * 8 + 2)
#define                                 U2ABDIE_bit         _BIT_ACCESS(U2UIR,2)
// U2UIR<U2ABDIF>
extern volatile __bit                   U2ABDIF             __at(0x1626);	// @ (0x2C4 * 8 + 6)
#define                                 U2ABDIF_bit         _BIT_ACCESS(U2UIR,6)
// U2ERRIE<U2ABDOVE>
extern volatile __bit                   U2ABDOVE            __at(0x1635);	// @ (0x2C6 * 8 + 5)
#define                                 U2ABDOVE_bit        _BIT_ACCESS(U2ERRIE,5)
// U2ERRIR<U2ABDOVF>
extern volatile __bit                   U2ABDOVF            __at(0x162D);	// @ (0x2C5 * 8 + 5)
#define                                 U2ABDOVF_bit        _BIT_ACCESS(U2ERRIR,5)
// U2CON0<U2BRGS>
extern volatile __bit                   U2BRGS              __at(0x15F7);	// @ (0x2BE * 8 + 7)
#define                                 U2BRGS_bit          _BIT_ACCESS(U2CON0,7)
// U2CON1<U2BRKOVR>
extern volatile __bit                   U2BRKOVR            __at(0x15F9);	// @ (0x2BF * 8 + 1)
#define                                 U2BRKOVR_bit        _BIT_ACCESS(U2CON1,1)
// U2ERRIE<U2CERIE>
extern volatile __bit                   U2CERIE             __at(0x1634);	// @ (0x2C6 * 8 + 4)
#define                                 U2CERIE_bit         _BIT_ACCESS(U2ERRIE,4)
// U2ERRIR<U2CERIF>
extern volatile __bit                   U2CERIF             __at(0x162C);	// @ (0x2C5 * 8 + 4)
#define                                 U2CERIF_bit         _BIT_ACCESS(U2ERRIR,4)
// U2CTSPPS<U2CTSPPS0>
extern volatile __bit                   U2CTSPPS0           __at(0x13A8);	// @ (0x275 * 8 + 0)
#define                                 U2CTSPPS0_bit       _BIT_ACCESS(U2CTSPPS,0)
// U2CTSPPS<U2CTSPPS1>
extern volatile __bit                   U2CTSPPS1           __at(0x13A9);	// @ (0x275 * 8 + 1)
#define                                 U2CTSPPS1_bit       _BIT_ACCESS(U2CTSPPS,1)
// U2CTSPPS<U2CTSPPS2>
extern volatile __bit                   U2CTSPPS2           __at(0x13AA);	// @ (0x275 * 8 + 2)
#define                                 U2CTSPPS2_bit       _BIT_ACCESS(U2CTSPPS,2)
// U2CTSPPS<U2CTSPPS3>
extern volatile __bit                   U2CTSPPS3           __at(0x13AB);	// @ (0x275 * 8 + 3)
#define                                 U2CTSPPS3_bit       _BIT_ACCESS(U2CTSPPS,3)
// U2CTSPPS<U2CTSPPS4>
extern volatile __bit                   U2CTSPPS4           __at(0x13AC);	// @ (0x275 * 8 + 4)
#define                                 U2CTSPPS4_bit       _BIT_ACCESS(U2CTSPPS,4)
// PIE8<U2EIE>
extern volatile __bit                   U2EIE               __at(0x2532);	// @ (0x4A6 * 8 + 2)
#define                                 U2EIE_bit           _BIT_ACCESS(PIE8,2)
// PIR8<U2EIF>
extern volatile __bit                   U2EIF               __at(0x25B2);	// @ (0x4B6 * 8 + 2)
#define                                 U2EIF_bit           _BIT_ACCESS(PIR8,2)
// IPR8<U2EIP>
extern volatile __bit                   U2EIP               __at(0x1B52);	// @ (0x36A * 8 + 2)
#define                                 U2EIP_bit           _BIT_ACCESS(IPR8,2)
// U2ERRIE<U2FERIE>
extern volatile __bit                   U2FERIE             __at(0x1633);	// @ (0x2C6 * 8 + 3)
#define                                 U2FERIE_bit         _BIT_ACCESS(U2ERRIE,3)
// U2ERRIR<U2FERIF>
extern volatile __bit                   U2FERIF             __at(0x162B);	// @ (0x2C5 * 8 + 3)
#define                                 U2FERIF_bit         _BIT_ACCESS(U2ERRIR,3)
// U2CON2<U2FLO0>
extern volatile __bit                   U2FLO0              __at(0x1600);	// @ (0x2C0 * 8 + 0)
#define                                 U2FLO0_bit          _BIT_ACCESS(U2CON2,0)
// U2CON2<U2FLO1>
extern volatile __bit                   U2FLO1              __at(0x1601);	// @ (0x2C0 * 8 + 1)
#define                                 U2FLO1_bit          _BIT_ACCESS(U2CON2,1)
// PIE8<U2IE>
extern volatile __bit                   U2IE                __at(0x2533);	// @ (0x4A6 * 8 + 3)
#define                                 U2IE_bit            _BIT_ACCESS(PIE8,3)
// PIR8<U2IF>
extern volatile __bit                   U2IF                __at(0x25B3);	// @ (0x4B6 * 8 + 3)
#define                                 U2IF_bit            _BIT_ACCESS(PIR8,3)
// IPR8<U2IP>
extern volatile __bit                   U2IP                __at(0x1B53);	// @ (0x36A * 8 + 3)
#define                                 U2IP_bit            _BIT_ACCESS(IPR8,3)
// PMD6<U2MD>
extern volatile __bit                   U2MD                __at(0x334);	// @ (0x66 * 8 + 4)
#define                                 U2MD_bit            _BIT_ACCESS(PMD6,4)
// U2CON0<U2MODE0>
extern volatile __bit                   U2MODE0             __at(0x15F0);	// @ (0x2BE * 8 + 0)
#define                                 U2MODE0_bit         _BIT_ACCESS(U2CON0,0)
// U2CON0<U2MODE1>
extern volatile __bit                   U2MODE1             __at(0x15F1);	// @ (0x2BE * 8 + 1)
#define                                 U2MODE1_bit         _BIT_ACCESS(U2CON0,1)
// U2CON0<U2MODE2>
extern volatile __bit                   U2MODE2             __at(0x15F2);	// @ (0x2BE * 8 + 2)
#define                                 U2MODE2_bit         _BIT_ACCESS(U2CON0,2)
// U2CON1<U2ON>
extern volatile __bit                   U2ON                __at(0x15FF);	// @ (0x2BF * 8 + 7)
#define                                 U2ON_bit            _BIT_ACCESS(U2CON1,7)
// U2ERRIE<U2PERIE>
extern volatile __bit                   U2PERIE             __at(0x1636);	// @ (0x2C6 * 8 + 6)
#define                                 U2PERIE_bit         _BIT_ACCESS(U2ERRIE,6)
// U2ERRIR<U2PERIF>
extern volatile __bit                   U2PERIF             __at(0x162E);	// @ (0x2C5 * 8 + 6)
#define                                 U2PERIF_bit         _BIT_ACCESS(U2ERRIR,6)
// U2FIFO<U2RCIDL>
extern volatile __bit                   U2RCIDL             __at(0x161B);	// @ (0x2C3 * 8 + 3)
#define                                 U2RCIDL_bit         _BIT_ACCESS(U2FIFO,3)
// U2CON2<U2RUNOVF>
extern volatile __bit                   U2RUNOVF            __at(0x1607);	// @ (0x2C0 * 8 + 7)
#define                                 U2RUNOVF_bit        _BIT_ACCESS(U2CON2,7)
// U2FIFO<U2RXBE>
extern volatile __bit                   U2RXBE              __at(0x1619);	// @ (0x2C3 * 8 + 1)
#define                                 U2RXBE_bit          _BIT_ACCESS(U2FIFO,1)
// U2FIFO<U2RXBF>
extern volatile __bit                   U2RXBF              __at(0x1618);	// @ (0x2C3 * 8 + 0)
#define                                 U2RXBF_bit          _BIT_ACCESS(U2FIFO,0)
// U2CON1<U2RXBIMD>
extern volatile __bit                   U2RXBIMD            __at(0x15FB);	// @ (0x2BF * 8 + 3)
#define                                 U2RXBIMD_bit        _BIT_ACCESS(U2CON1,3)
// U2ERRIE<U2RXBKIE>
extern volatile __bit                   U2RXBKIE            __at(0x1632);	// @ (0x2C6 * 8 + 2)
#define                                 U2RXBKIE_bit        _BIT_ACCESS(U2ERRIE,2)
// U2ERRIR<U2RXBKIF>
extern volatile __bit                   U2RXBKIF            __at(0x162A);	// @ (0x2C5 * 8 + 2)
#define                                 U2RXBKIF_bit        _BIT_ACCESS(U2ERRIR,2)
// U2CON0<U2RXEN>
extern volatile __bit                   U2RXEN              __at(0x15F4);	// @ (0x2BE * 8 + 4)
#define                                 U2RXEN_bit          _BIT_ACCESS(U2CON0,4)
// U2ERRIE<U2RXFOIE>
extern volatile __bit                   U2RXFOIE            __at(0x1631);	// @ (0x2C6 * 8 + 1)
#define                                 U2RXFOIE_bit        _BIT_ACCESS(U2ERRIE,1)
// U2ERRIR<U2RXFOIF>
extern volatile __bit                   U2RXFOIF            __at(0x1629);	// @ (0x2C5 * 8 + 1)
#define                                 U2RXFOIF_bit        _BIT_ACCESS(U2ERRIR,1)
// U2FIFO<U2RXIDL>
extern volatile __bit                   U2RXIDL             __at(0x161B);	// @ (0x2C3 * 8 + 3)
#define                                 U2RXIDL_bit         _BIT_ACCESS(U2FIFO,3)
// PIE8<U2RXIE>
extern volatile __bit                   U2RXIE              __at(0x2530);	// @ (0x4A6 * 8 + 0)
#define                                 U2RXIE_bit          _BIT_ACCESS(PIE8,0)
// PIR8<U2RXIF>
extern volatile __bit                   U2RXIF              __at(0x25B0);	// @ (0x4B6 * 8 + 0)
#define                                 U2RXIF_bit          _BIT_ACCESS(PIR8,0)
// IPR8<U2RXIP>
extern volatile __bit                   U2RXIP              __at(0x1B50);	// @ (0x36A * 8 + 0)
#define                                 U2RXIP_bit          _BIT_ACCESS(IPR8,0)
// U2CON2<U2RXPOL>
extern volatile __bit                   U2RXPOL             __at(0x1606);	// @ (0x2C0 * 8 + 6)
#define                                 U2RXPOL_bit         _BIT_ACCESS(U2CON2,6)
// U2RXPPS<U2RXPPS0>
extern volatile __bit                   U2RXPPS0            __at(0x13A0);	// @ (0x274 * 8 + 0)
#define                                 U2RXPPS0_bit        _BIT_ACCESS(U2RXPPS,0)
// U2RXPPS<U2RXPPS1>
extern volatile __bit                   U2RXPPS1            __at(0x13A1);	// @ (0x274 * 8 + 1)
#define                                 U2RXPPS1_bit        _BIT_ACCESS(U2RXPPS,1)
// U2RXPPS<U2RXPPS2>
extern volatile __bit                   U2RXPPS2            __at(0x13A2);	// @ (0x274 * 8 + 2)
#define                                 U2RXPPS2_bit        _BIT_ACCESS(U2RXPPS,2)
// U2RXPPS<U2RXPPS3>
extern volatile __bit                   U2RXPPS3            __at(0x13A3);	// @ (0x274 * 8 + 3)
#define                                 U2RXPPS3_bit        _BIT_ACCESS(U2RXPPS,3)
// U2RXPPS<U2RXPPS4>
extern volatile __bit                   U2RXPPS4            __at(0x13A4);	// @ (0x274 * 8 + 4)
#define                                 U2RXPPS4_bit        _BIT_ACCESS(U2RXPPS,4)
// U2CON1<U2SENDB>
extern volatile __bit                   U2SENDB             __at(0x15F8);	// @ (0x2BF * 8 + 0)
#define                                 U2SENDB_bit         _BIT_ACCESS(U2CON1,0)
// U2CON2<U2STP0>
extern volatile __bit                   U2STP0              __at(0x1604);	// @ (0x2C0 * 8 + 4)
#define                                 U2STP0_bit          _BIT_ACCESS(U2CON2,4)
// U2CON2<U2STP1>
extern volatile __bit                   U2STP1              __at(0x1605);	// @ (0x2C0 * 8 + 5)
#define                                 U2STP1_bit          _BIT_ACCESS(U2CON2,5)
// U2FIFO<U2STPMD>
extern volatile __bit                   U2STPMD             __at(0x161E);	// @ (0x2C3 * 8 + 6)
#define                                 U2STPMD_bit         _BIT_ACCESS(U2FIFO,6)
// U2FIFO<U2TXBE>
extern volatile __bit                   U2TXBE              __at(0x161D);	// @ (0x2C3 * 8 + 5)
#define                                 U2TXBE_bit          _BIT_ACCESS(U2FIFO,5)
// U2FIFO<U2TXBF>
extern volatile __bit                   U2TXBF              __at(0x161C);	// @ (0x2C3 * 8 + 4)
#define                                 U2TXBF_bit          _BIT_ACCESS(U2FIFO,4)
// U2ERRIE<U2TXCIE>
extern volatile __bit                   U2TXCIE             __at(0x1630);	// @ (0x2C6 * 8 + 0)
#define                                 U2TXCIE_bit         _BIT_ACCESS(U2ERRIE,0)
// U2ERRIR<U2TXCIF>
extern volatile __bit                   U2TXCIF             __at(0x1628);	// @ (0x2C5 * 8 + 0)
#define                                 U2TXCIF_bit         _BIT_ACCESS(U2ERRIR,0)
// U2CON0<U2TXEN>
extern volatile __bit                   U2TXEN              __at(0x15F5);	// @ (0x2BE * 8 + 5)
#define                                 U2TXEN_bit          _BIT_ACCESS(U2CON0,5)
// PIE8<U2TXIE>
extern volatile __bit                   U2TXIE              __at(0x2531);	// @ (0x4A6 * 8 + 1)
#define                                 U2TXIE_bit          _BIT_ACCESS(PIE8,1)
// PIR8<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x25B1);	// @ (0x4B6 * 8 + 1)
#define                                 U2TXIF_bit          _BIT_ACCESS(PIR8,1)
// IPR8<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x1B51);	// @ (0x36A * 8 + 1)
#define                                 U2TXIP_bit          _BIT_ACCESS(IPR8,1)
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0x1637);	// @ (0x2C6 * 8 + 7)
#define                                 U2TXMTIE_bit        _BIT_ACCESS(U2ERRIE,7)
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0x162F);	// @ (0x2C5 * 8 + 7)
#define                                 U2TXMTIF_bit        _BIT_ACCESS(U2ERRIR,7)
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0x1602);	// @ (0x2C0 * 8 + 2)
#define                                 U2TXPOL_bit         _BIT_ACCESS(U2CON2,2)
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0x161F);	// @ (0x2C3 * 8 + 7)
#define                                 U2TXWRE_bit         _BIT_ACCESS(U2FIFO,7)
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0x15FC);	// @ (0x2BF * 8 + 4)
#define                                 U2WUE_bit           _BIT_ACCESS(U2CON1,4)
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0x1627);	// @ (0x2C4 * 8 + 7)
#define                                 U2WUIF_bit          _BIT_ACCESS(U2UIR,7)
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0x161A);	// @ (0x2C3 * 8 + 2)
#define                                 U2XON_bit           _BIT_ACCESS(U2FIFO,2)
// U3CON0<U3ABDEN>
extern volatile __bit                   U3ABDEN             __at(0x168E);	// @ (0x2D1 * 8 + 6)
#define                                 U3ABDEN_bit         _BIT_ACCESS(U3CON0,6)
// U3UIR<U3ABDIE>
extern volatile __bit                   U3ABDIE             __at(0x16BA);	// @ (0x2D7 * 8 + 2)
#define                                 U3ABDIE_bit         _BIT_ACCESS(U3UIR,2)
// U3UIR<U3ABDIF>
extern volatile __bit                   U3ABDIF             __at(0x16BE);	// @ (0x2D7 * 8 + 6)
#define                                 U3ABDIF_bit         _BIT_ACCESS(U3UIR,6)
// U3ERRIE<U3ABDOVE>
extern volatile __bit                   U3ABDOVE            __at(0x16CD);	// @ (0x2D9 * 8 + 5)
#define                                 U3ABDOVE_bit        _BIT_ACCESS(U3ERRIE,5)
// U3ERRIR<U3ABDOVF>
extern volatile __bit                   U3ABDOVF            __at(0x16C5);	// @ (0x2D8 * 8 + 5)
#define                                 U3ABDOVF_bit        _BIT_ACCESS(U3ERRIR,5)
// U3CON0<U3BRGS>
extern volatile __bit                   U3BRGS              __at(0x168F);	// @ (0x2D1 * 8 + 7)
#define                                 U3BRGS_bit          _BIT_ACCESS(U3CON0,7)
// U3CON1<U3BRKOVR>
extern volatile __bit                   U3BRKOVR            __at(0x1691);	// @ (0x2D2 * 8 + 1)
#define                                 U3BRKOVR_bit        _BIT_ACCESS(U3CON1,1)
// U3ERRIE<U3CERIE>
extern volatile __bit                   U3CERIE             __at(0x16CC);	// @ (0x2D9 * 8 + 4)
#define                                 U3CERIE_bit         _BIT_ACCESS(U3ERRIE,4)
// U3ERRIR<U3CERIF>
extern volatile __bit                   U3CERIF             __at(0x16C4);	// @ (0x2D8 * 8 + 4)
#define                                 U3CERIF_bit         _BIT_ACCESS(U3ERRIR,4)
// U3CTSPPS<U3CTSPPS0>
extern volatile __bit                   U3CTSPPS0           __at(0x13B8);	// @ (0x277 * 8 + 0)
#define                                 U3CTSPPS0_bit       _BIT_ACCESS(U3CTSPPS,0)
// U3CTSPPS<U3CTSPPS1>
extern volatile __bit                   U3CTSPPS1           __at(0x13B9);	// @ (0x277 * 8 + 1)
#define                                 U3CTSPPS1_bit       _BIT_ACCESS(U3CTSPPS,1)
// U3CTSPPS<U3CTSPPS2>
extern volatile __bit                   U3CTSPPS2           __at(0x13BA);	// @ (0x277 * 8 + 2)
#define                                 U3CTSPPS2_bit       _BIT_ACCESS(U3CTSPPS,2)
// U3CTSPPS<U3CTSPPS3>
extern volatile __bit                   U3CTSPPS3           __at(0x13BB);	// @ (0x277 * 8 + 3)
#define                                 U3CTSPPS3_bit       _BIT_ACCESS(U3CTSPPS,3)
// U3CTSPPS<U3CTSPPS4>
extern volatile __bit                   U3CTSPPS4           __at(0x13BC);	// @ (0x277 * 8 + 4)
#define                                 U3CTSPPS4_bit       _BIT_ACCESS(U3CTSPPS,4)
// U3CTSPPS<U3CTSPPS5>
extern volatile __bit                   U3CTSPPS5           __at(0x13BD);	// @ (0x277 * 8 + 5)
#define                                 U3CTSPPS5_bit       _BIT_ACCESS(U3CTSPPS,5)
// PIE9<U3EIE>
extern volatile __bit                   U3EIE               __at(0x253A);	// @ (0x4A7 * 8 + 2)
#define                                 U3EIE_bit           _BIT_ACCESS(PIE9,2)
// PIR9<U3EIF>
extern volatile __bit                   U3EIF               __at(0x25BA);	// @ (0x4B7 * 8 + 2)
#define                                 U3EIF_bit           _BIT_ACCESS(PIR9,2)
// IPR9<U3EIP>
extern volatile __bit                   U3EIP               __at(0x1B5A);	// @ (0x36B * 8 + 2)
#define                                 U3EIP_bit           _BIT_ACCESS(IPR9,2)
// U3ERRIE<U3FERIE>
extern volatile __bit                   U3FERIE             __at(0x16CB);	// @ (0x2D9 * 8 + 3)
#define                                 U3FERIE_bit         _BIT_ACCESS(U3ERRIE,3)
// U3ERRIR<U3FERIF>
extern volatile __bit                   U3FERIF             __at(0x16C3);	// @ (0x2D8 * 8 + 3)
#define                                 U3FERIF_bit         _BIT_ACCESS(U3ERRIR,3)
// U3CON2<U3FLO0>
extern volatile __bit                   U3FLO0              __at(0x1698);	// @ (0x2D3 * 8 + 0)
#define                                 U3FLO0_bit          _BIT_ACCESS(U3CON2,0)
// U3CON2<U3FLO1>
extern volatile __bit                   U3FLO1              __at(0x1699);	// @ (0x2D3 * 8 + 1)
#define                                 U3FLO1_bit          _BIT_ACCESS(U3CON2,1)
// PIE9<U3IE>
extern volatile __bit                   U3IE                __at(0x253B);	// @ (0x4A7 * 8 + 3)
#define                                 U3IE_bit            _BIT_ACCESS(PIE9,3)
// PIR9<U3IF>
extern volatile __bit                   U3IF                __at(0x25BB);	// @ (0x4B7 * 8 + 3)
#define                                 U3IF_bit            _BIT_ACCESS(PIR9,3)
// IPR9<U3IP>
